# FileVersion Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExporterIFC..::..FileVersion Property
ExporterIFC Class See Also
---
Identifies the file version being exported.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public IFCVersion FileVersion { get; }
```

Visual Basic
---
```text
Public ReadOnly Property FileVersion As IFCVersion
	Get
```

Visual C++
---
```text
public:
property IFCVersion FileVersion {
	IFCVersion get ();
}
```

# See Also
ExporterIFC Class
Autodesk.Revit.DB.IFC Namespace